app/views/users/cart.html.erb

SELECT `basketpositions`.* FROM `basketpositions`  WHERE `basketpositions`.`user_id` = 9
---
  <tbody>
    <% current_user.basketposition.each do |bp| %>