app/controllers/products_controller.rb

SELECT `products`.* FROM `products`  WHERE (name LIKE '%133%' OR description LIKE '%133%')
---
  def index
    @products = Product.search(params[:search])

INSERT INTO `basketpositions` (`created_at`, `how_many`, `product_id`, `updated_at`, `user_id`) VALUES ('2014-12-05 03:36:35', 2, 1, '2014-12-05 03:36:35', 9)
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 'product_id' LIMIT 1
---
  def add_to_basket
     a = Basketposition.create(user_id: params[:basketposition][:user_id],
                               product_id: params[:basketposition][:product_id],
                               how_many: params[:basketposition][:amount])
     if a.save
       redirect_to root_path
     else
       redirect_to Product.find(params[:basketposition][:product_id]), notice: 'Coudln\'nt add product.'

INSERT INTO `products` (`amount`, `created_at`, `description`, `name`, `picture_content_type`, `picture_file_name`, `picture_file_size`, `picture_updated_at`, `price`, `since`, `until`, `updated_at`) VALUES (2, '2014-12-03 10:42:01', 'asdf', 'penis', 'image/jpeg', 'r92wee.jpg', 27437, '2014-12-03 10:42:01', 2, '2014-12-03', '2014-12-03', '2014-12-03 10:42:01')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE `products` SET `description` = 'sehr nice!', `name` = 'Schimmel', `updated_at` = '2014-12-04 18:46:05' WHERE `products`.`id` = 1
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM `products` WHERE `products`.`id` = 1
---
  def destroy
    @product.destroy

SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 4 LIMIT 1
---
  def set_product
    @product = Product.find(params[:id])