app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `name`, `password_digest`, `updated_at`) VALUES ('2014-12-04 14:12:10', 'alex.mantel@haw-hamburg.de', 'klaus', '$2a$10$u33cRqX2OpIx0pMkYfJdHeQw6nn0G4vf6z9Q6P.yvX5Xa3.v0N7iy', '2014-12-04 14:12:10')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT  `users`.* FROM `users`  WHERE `users`.`id` IS NULL LIMIT 1
---
    def set_user
      @user = User.find(params[:id])